/** @fille
 * 参考代码
 * 参考内容：第7章 LED点阵显示横向移动的动画(7.5.2节)
 */

#include "mylib.h"

#define FRAME_SIZE 30      //!< 本程序中图片分为30帧
#define UPDATE_PERIOD 250  //!< 本程序 250 ms更新一帧

unsigned char code image[FRAME_SIZE][ROW_SIZE] = {
    //  动画帧0
    {0xFF,  // ........
     0xFF,  // ........
     0xFF,  // ........
     0xFF,  // ........
     0xFF,  // ........
     0xFF,  // ........
     0xFF,  // ........
     0xFF},
    // 动画帧1
    {0xFF,  // ........
     0x7F,  // .......@
     0xFF,  // ........
     0xFF,  // ........
     0xFF,  // ........
     0xFF,  // ........
     0xFF,  // ........
     0x7F},
    {0xFF,   // ........
     0x3F,   // ......@@
     0x7F,   // .......@
     0x7F,   // .......@
     0x7F,   // .......@
     0x7F,   // .......@
     0x7F,   // .......@
     0x3F},  // 动画帧3
    {0xFF,   // ........
     0x1F,   // .....@@@
     0x3F,   // ......@@
     0x3F,   // ......@@
     0x3F,   // ......@@
     0x3F,   // ......@@
     0x3F,   // ......@@
     0x1F},  //动画帧4
    {0xFF,   // ........
     0x0F,   // ....@@@@
     0x9F,   // .....@@.
     0x9F,   // .....@@.
     0x9F,   // .....@@.
     0x9F,   // .....@@.
     0x9F,   // .....@@.
     0x0F},  //动画帧5
    {0xFF,   // ........
     0x87,   // ...@@@@.
     0xCF,   // ....@@..
     0xCF,   // ....@@..
     0xCF,   // ....@@..
     0xCF,   // ....@@..
     0xCF,   // ....@@..
     0x87},  //动画帧6
    {0xFF,   // ........
     0xC3,   // ..@@@@..
     0xE7,   // ...@@...
     0xE7,   // ...@@...
     0xE7,   // ...@@...
     0xE7,   // ...@@...
     0xE7,   // ...@@...
     0xC3},  //动画帧7
    {0xFF,   // ........
     0xE1,   // .@@@@...
     0x73,   // ..@@...@
     0x73,   // ..@@...@
     0x73,   // ..@@...@
     0xF3,   // ..@@....
     0xF3,   // ..@@....
     0xE1},  //动画帧8
    {0xFF,   // ........
     0x70,   // @@@@...@
     0x39,   // .@@...@@
     0x39,   // .@@...@@
     0x39,   // .@@...@@
     0x79,   // .@@....@
     0xF9,   // .@@.....
     0xF0},  //动画帧9
    {0xFF,   // ........
     0x38,   // @@@...@@
     0x1C,   // @@...@@@
     0x1C,   // @@...@@@
     0x1C,   // @@...@@@
     0x3C,   // @@....@@
     0x7C,   // @@.....@
     0xF8},  //动画帧10
    {0xFF,   // ........
     0x9C,   // @@...@@.
     0x0E,   // @...@@@@
     0x0E,   // @...@@@@
     0x0E,   // @...@@@@
     0x1E,   // @....@@@
     0x3E,   // @.....@@
     0x7C},  //动画帧11
    {0xFF,   // ........
     0xCE,   // @...@@..
     0x07,   // ...@@@@@
     0x07,   // ...@@@@@
     0x07,   // ...@@@@@
     0x0F,   // ....@@@@
     0x1F,   // .....@@@
     0x3E},  //动画帧12
    {0xFF,   // ........
     0x67,   // ...@@..@
     0x03,   // ..@@@@@@
     0x03,   // ..@@@@@@
     0x03,   // ..@@@@@@
     0x07,   // ...@@@@@
     0x0F,   // ....@@@@
     0x9F},  //动画帧13
    {0xFF,   // ........
     0x33,   // ..@@..@@
     0x01,   // .@@@@@@@
     0x01,   // .@@@@@@@
     0x01,   // .@@@@@@@
     0x03,   // ..@@@@@@
     0x87,   // ...@@@@.
     0xCF},  //动画帧14
    {0xFF,   // ........
     0x99,   // .@@..@@.
     0x00,   // @@@@@@@@
     0x00,   // @@@@@@@@
     0x00,   // @@@@@@@@
     0x81,   // .@@@@@@.
     0xC3,   // ..@@@@..
     0xE7},  //动画帧15
    {0xFF,   // ........
     0xCC,   // @@..@@..
     0x80,   // @@@@@@@.
     0x80,   // @@@@@@@.
     0x80,   // @@@@@@@.
     0xC0,   // @@@@@@..
     0xE1,   // .@@@@...
     0xF3},  //动画帧16
    {0xFF,   // ........
     0xE6,   // @..@@...
     0xC0,   // @@@@@@..
     0xC0,   // @@@@@@..
     0xC0,   // @@@@@@..
     0xE0,   // @@@@@...
     0xF0,   // @@@@....
     0xF9},  //动画帧17
    {0xFF,   // ........
     0x73,   // ..@@...@
     0x60,   // @@@@@..@
     0x60,   // @@@@@..@
     0x60,   // @@@@@..@
     0x70,   // @@@@...@
     0x78,   // @@@....@
     0xFC},  //动画帧18
    {0xFF,   // ........
     0x39,   // .@@...@@
     0x30,   // @@@@..@@
     0x30,   // @@@@..@@
     0x30,   // @@@@..@@
     0x38,   // @@@...@@
     0x3C,   // @@....@@
     0x7E},  //动画帧19
    {0xFF,   // ........
     0x9C,   // @@...@@.
     0x98,   // @@@..@@.
     0x98,   // @@@..@@.
     0x98,   // @@@..@@.
     0x9C,   // @@...@@.
     0x1E,   // @....@@@
     0x3F},  //动画帧20
    {0xFF,   // ........
     0xCE,   // @...@@..
     0xCC,   // @@..@@..
     0xCC,   // @@..@@..
     0xCC,   // @@..@@..
     0xCE,   // @...@@..
     0x0F,   // ....@@@@
     0x1F},  //动画帧21
    {0xFF,   // ........
     0x67,   // ...@@..@
     0x66,   // @..@@..@
     0x66,   // @..@@..@
     0x66,   // @..@@..@
     0x67,   // ...@@..@
     0x07,   // ...@@@@@
     0x0F},  //动画帧22
    {0xFF,   // ........
     0x33,   // ..@@..@@
     0x33,   // ..@@..@@
     0x33,   // ..@@..@@
     0x33,   // ..@@..@@
     0x33,   // ..@@..@@
     0x03,   // ..@@@@@@
     0x87},  //动画帧23
    {0xFF,   // ........
     0x99,   // .@@..@@.
     0x99,   // .@@..@@.
     0x99,   // .@@..@@.
     0x99,   // .@@..@@.
     0x99,   // .@@..@@.
     0x81,   // .@@@@@@.
     0xC3},  //动画帧24
    {0xFF,   // ........
     0xCC,   // @@..@@..
     0xCC,   // @@..@@..
     0xCC,   // @@..@@..
     0xCC,   // @@..@@..
     0xCC,   // @@..@@..
     0xC0,   // @@@@@@..
     0xE1},  //动画帧25
    {0xFF,   // ........
     0xE6,   // @..@@...
     0xE6,   // @..@@...
     0xE6,   // @..@@...
     0xE6,   // @..@@...
     0xE6,   // @..@@...
     0xE0,   // @@@@@...
     0xF0},  //动画帧26
    {0xFF,   // ........
     0xF3,   // ..@@....
     0xF3,   // ..@@....
     0xF3,   // ..@@....
     0xF3,   // ..@@....
     0xF3,   // ..@@....
     0xF0,   // @@@@....
     0xF8},  //动画帧27
    {0xFF,   // ........
     0xF9,   // .@@.....
     0xF9,   // .@@.....
     0xF9,   // .@@.....
     0xF9,   // .@@.....
     0xF9,   // .@@.....
     0xF8,   // @@@.....
     0xFC},  //动画帧28
    {0xFF,   // ........
     0xFC,   // @@......
     0xFC,   // @@......
     0xFC,   // @@......
     0xFC,   // @@......
     0xFC,   // @@......
     0xFC,   // @@......
     0xFE},  //动画帧29
    {0xFF,   // ........
     0xFE,   // @.......
     0xFE,   // @.......
     0xFE,   // @.......
     0xFE,   // @.......
     0xFE,   // @.......
     0xFE,   // @.......
     0xFF}   //动画帧30
};

void main() {
  enable_timer_t0_with_interrupt();
  TIME_1MS();
  while (TRUE) {
    ;
  }
}
/* 定时器0中断服务函数 */
// void flush_and_update() interrupt T0_OVERFLOW {
// static usingned char frame_id = TAIL_FRAME;  // 初始显示最后一帧
// static unsigned char i = 0;      //动态扫描的索引
// static unsigned char tmr = 0;    // 250ms软件定时器
// static unsigned char index = 0;  //图片刷新索引
//
// TH0 = 0xFC;  //重新加载初值
// TL0 = 0x67;
// //以下代码完成LED点阵动态扫描刷新
// P0 = 0xFF;  //显示消隐
// switch (i) {
//   case 0:
//     ADDR2 = 0;
//     ADDR1 = 0;
//     ADDR0 = 0;
//     i++;
//     P0 = image[index][0];
//     break;
//   case 1:
//     ADDR2 = 0;
//     ADDR1 = 0;
//     ADDR0 = 1;
//     i++;
//     P0 = image[index][1];
//     break;
//   case 2:
//     ADDR2 = 0;
//     ADDR1 = 1;
//     ADDR0 = 0;
//     i++;
//     P0 = image[index][2];
//     break;
//   case 3:
//     ADDR2 = 0;
//     ADDR1 = 1;
//     ADDR0 = 1;
//     i++;
//     P0 = image[index][3];
//     break;
//   case 4:
//     ADDR2 = 1;
//     ADDR1 = 0;
//     ADDR0 = 0;
//     i++;
//     P0 = image[index][4];
//     break;
//   case 5:
//     ADDR2 = 1;
//     ADDR1 = 0;
//     ADDR0 = 1;
//     i++;
//     P0 = image[index][5];
//     break;
//   case 6:
//     ADDR2 = 1;
//     ADDR1 = 1;
//     ADDR0 = 0;
//     i++;
//     P0 = image[index][6];
//     break;
//   case 7:
//     ADDR2 = 1;
//     ADDR1 = 1;
//     ADDR0 = 1;
//     i = 0;
//     P0 = image[index][7];
//     break;
//   default:
//     break;
// }
// //以下代码完成每250ms改变一帧图像
// tmr++;
// if (tmr >= 250)  //达到250ms时改变一次图片索引
// {
//   tmr = 0;
//   index++;
//   if (index >= 30)  //图片索引达到30后归零
//   {
//     index = 0;
//   }
// }
// }
/**
 * T0溢出中断服务函数，
 * T0溢出一次刷新一次，
 * 每250ms 更新一次显示图像
 */
void flash_and_slide() interrupt T0_OVERFLOW {
  static unsigned char row_id = 0;    // 每次中断刷新一行
  static unsigned char ms_count = 0;  // 记录经过的毫秒数

  // 图片单元，由下往上，首先是最后一帧
  static unsigned char frame_unit = FRAME_SIZE - 1;

  ++ms_count;  // 经过1ms

  // 重新加载初值
  TIME_1MS();

  // 刷新图像
  show_in_array(row_id, image[frame_unit][row_id]);
  ++row_id;
  row_id %= ROW_SIZE;

  // 没 250 ms 刷新一次图像，显示左边一单元
  if (ms_count == UPDATE_PERIOD) {
    ms_count = 0;
    --frame_unit;
    if (frame_unit == 0) {
      frame_unit = FRAME_SIZE - 1;
    }
  }
}
